#include "delay.h"


/**************************************
延时n毫秒(STC90C52RC@12M)
不同的工作环境,需要调整此函数，注意时钟过快时需要修改
**************************************/
void Delay_nms(unsigned int n)	
{						
	unsigned int i,j;	
	
	for(i=0;i<n;i++)
	{			
		for(j=0;j<121;j++)			
		{;}
	}						
}

/**************************************
延时5微秒(STC90C52RC@12M)
不同的工作环境,需要调整此函数，注意时钟过快时需要修改
**************************************/
void Delay_4us(void)
{
	_nop_();
	_nop_();
	_nop_();
    _nop_();
}

///**************************************
//延时5毫秒(STC90C52RC@12M)
//不同的工作环境,需要调整此函数
//**************************************/
//void Delay5ms()
//{
//    uint n = 560;
//
//    while (n--);
//}